// AA发票数据：
[
    {
        "text": "合",
        "x": 73.15,
        "y": 266.04,
        "width": 9.000000000000002,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "计",
        "x": 109.15,
        "y": 266.04,
        "width": 9.000000000000002,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "备",
        "x": 350.09,
        "y": 311.96,
        "width": 9.000000000000002,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "注",
        "x": 350.09,
        "y": 338.32,
        "width": 9.000000000000002,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "AA增值税电子普通发票",
        "x": 195.29,
        "y": 39.01999999999998,
        "width": 220,
        "height": 20,
        "pageIndex": 0
    },
    {
        "text": "价税合计（大写）",
        "x": 60.98,
        "y": 283.9,
        "width": 72.00000000000001,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "（小写）",
        "x": 464.98,
        "y": 283.9,
        "width": 36.00000000000001,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "货物或应税劳务、服务名称",
        "x": 41.42,
        "y": 156.05,
        "width": 108.00000000000001,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "规格型号",
        "x": 189.42,
        "y": 156.05,
        "width": 36.00000000000001,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "单位",
        "x": 251.42,
        "y": 156.05,
        "width": 18.000000000000004,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "数",
        "x": 292.42,
        "y": 156.05,
        "width": 9.000000000000002,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "量",
        "x": 310.42,
        "y": 156.05,
        "width": 9.000000000000002,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "单",
        "x": 350.42,
        "y": 156.05,
        "width": 9.000000000000002,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "价",
        "x": 368.42,
        "y": 156.05,
        "width": 9.000000000000002,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "金",
        "x": 415.42,
        "y": 156.05,
        "width": 9.000000000000002,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "额",
        "x": 433.42,
        "y": 156.05,
        "width": 9.000000000000002,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "税率",
        "x": 482.42,
        "y": 156.05,
        "width": 18.000000000000004,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "税",
        "x": 531.42,
        "y": 156.05,
        "width": 9.000000000000002,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "额",
        "x": 549.42,
        "y": 156.05,
        "width": 9.000000000000002,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "购",
        "x": 28.66,
        "y": 99.49000000000001,
        "width": 9.000000000000002,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "买",
        "x": 28.66,
        "y": 114.99000000000001,
        "width": 9.000000000000002,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "方",
        "x": 28.66,
        "y": 131.44,
        "width": 9.000000000000002,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "销",
        "x": 28.09,
        "y": 309.54,
        "width": 9.000000000000002,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "售",
        "x": 28.09,
        "y": 325.04,
        "width": 9.000000000000002,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "方",
        "x": 28.09,
        "y": 340.07,
        "width": 9.000000000000002,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "收 款 人:",
        "x": 30.93,
        "y": 361.14,
        "width": 40.50000000000001,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "复 核:",
        "x": 196.93,
        "y": 361.14,
        "width": 27.000000000000004,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "开 票 人:",
        "x": 317.93,
        "y": 361.14,
        "width": 40.50000000000001,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "销 售 方:（章）",
        "x": 441.93,
        "y": 361.14,
        "width": 67.50000000000001,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "密",
        "x": 349.83,
        "y": 100.91000000000003,
        "width": 9.000000000000002,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "码",
        "x": 349.83,
        "y": 116.41000000000003,
        "width": 9.000000000000002,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "区",
        "x": 349.83,
        "y": 132.86,
        "width": 9.000000000000002,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "机器编号:",
        "x": 24.39,
        "y": 76.97000000000003,
        "width": 40.50000000000001,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "名",
        "x": 48.22,
        "y": 93.61000000000001,
        "width": 9.000000000000002,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "称:",
        "x": 93.22,
        "y": 93.61000000000001,
        "width": 13.500000000000004,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "纳税人识别号:",
        "x": 48.22,
        "y": 107.61000000000001,
        "width": 58.50000000000001,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "地 址、",
        "x": 48.22,
        "y": 122.61000000000001,
        "width": 31.500000000000007,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "开户行及账号:",
        "x": 48.22,
        "y": 138.23,
        "width": 58.50000000000001,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "名",
        "x": 48.22,
        "y": 303.5,
        "width": 9.000000000000002,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "称:",
        "x": 93.22,
        "y": 303.5,
        "width": 13.500000000000004,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "纳税人识别号:",
        "x": 48.22,
        "y": 316.5,
        "width": 58.50000000000001,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "地 址、",
        "x": 48.22,
        "y": 330.5,
        "width": 31.500000000000007,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "开户行及账号:",
        "x": 48.22,
        "y": 344.15,
        "width": 58.50000000000001,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "发票代码:",
        "x": 432.31,
        "y": 30.329999999999984,
        "width": 40.50000000000001,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "发票号码:",
        "x": 432.31,
        "y": 44.829999999999984,
        "width": 40.50000000000001,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "开票日期:",
        "x": 432.31,
        "y": 58.829999999999984,
        "width": 40.50000000000001,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "校",
        "x": 432.31,
        "y": 73.24000000000001,
        "width": 9.000000000000002,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "验",
        "x": 445.78,
        "y": 73.57,
        "width": 9.000000000000002,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "码:",
        "x": 458.45,
        "y": 73.85000000000002,
        "width": 13.500000000000004,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "电 话:",
        "x": 78.43,
        "y": 330.39,
        "width": 27.000000000000004,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "电 话:",
        "x": 78.15,
        "y": 122.88999999999999,
        "width": 27.000000000000004,
        "height": 9,
        "pageIndex": 0
    },
    {
        "text": "￥",
        "x": 439.23,
        "y": 266.03,
        "width": 8.99,
        "height": 8.99,
        "pageIndex": 0
    },
    {
        "text": "29.76",
        "x": 448.22,
        "y": 266.03,
        "width": 22.474985615999998,
        "height": 8.99,
        "pageIndex": 0
    },
    {
        "text": "￥",
        "x": 563.07,
        "y": 266.03,
        "width": 8.99,
        "height": 8.99,
        "pageIndex": 0
    },
    {
        "text": "1.79",
        "x": 572.0600000000001,
        "y": 266.03,
        "width": 17.494539999999997,
        "height": 8.99,
        "pageIndex": 0
    },
    {
        "text": "*",
        "x": 24.83,
        "y": 168.72,
        "width": 3.4971099999999997,
        "height": 8.99,
        "pageIndex": 0
    },
    {
        "text": "旅游服务",
        "x": 28.33,
        "y": 168.72,
        "width": 35.96,
        "height": 8.99,
        "pageIndex": 0
    },
    {
        "text": "*",
        "x": 64.27,
        "y": 168.72,
        "width": 3.4971099999999997,
        "height": 8.99,
        "pageIndex": 0
    },
    {
        "text": "代订车服务费",
        "x": 67.77,
        "y": 168.72,
        "width": 53.940000000000005,
        "height": 8.99,
        "pageIndex": 0
    },
    {
        "text": "个",
        "x": 255.33,
        "y": 168.72,
        "width": 8.99,
        "height": 8.99,
        "pageIndex": 0
    },
    {
        "text": "1",
        "x": 325.83,
        "y": 168.72,
        "width": 4.9984399999999996,
        "height": 8.99,
        "pageIndex": 0
    },
    {
        "text": "29.76",
        "x": 365.34,
        "y": 168.72,
        "width": 22.492979999999996,
        "height": 8.99,
        "pageIndex": 0
    },
    {
        "text": "29.76",
        "x": 448.34,
        "y": 168.72,
        "width": 22.492979999999996,
        "height": 8.99,
        "pageIndex": 0
    },
    {
        "text": "6%",
        "x": 490.84,
        "y": 168.72,
        "width": 12.990549999999999,
        "height": 8.99,
        "pageIndex": 0
    },
    {
        "text": "1.79",
        "x": 571.39,
        "y": 168.72,
        "width": 17.494539999999997,
        "height": 8.99,
        "pageIndex": 0
    },
    {
        "text": "499098496994",
        "x": 69.31,
        "y": 76.97000000000003,
        "width": 60.114720000000005,
        "height": 9.01,
        "pageIndex": 0
    },
    {
        "text": "叁拾壹元伍角伍分",
        "x": 183.98,
        "y": 283.89,
        "width": 71.92,
        "height": 8.99,
        "pageIndex": 0
    },
    {
        "text": "将雪莲",
        "x": 79.93,
        "y": 361.14,
        "width": 26.97,
        "height": 8.99,
        "pageIndex": 0
    },
    {
        "text": "灿灿",
        "x": 231.93,
        "y": 361.14,
        "width": 17.98,
        "height": 8.99,
        "pageIndex": 0
    },
    {
        "text": "王丹",
        "x": 366.93,
        "y": 361.14,
        "width": 17.98,
        "height": 8.99,
        "pageIndex": 0
    },
    {
        "text": "0 3 2 - 7 / 5 1 2 - 25 < > 5 5 < 2 / + 6 < < 3 1 - 6 >",
        "x": 368.8,
        "y": 96.32,
        "width": 217.31410999999937,
        "height": 10.49,
        "pageIndex": 0
    },
    {
        "text": "8 6 - 4 8 > 1 3 3 1 9 4 6 / + 6 > 231 > < < * 0 2 - /",
        "x": 368.8,
        "y": 110.32,
        "width": 217.33782999999968,
        "height": 10.49,
        "pageIndex": 0
    },
    {
        "text": "* 3 + 5 7 4 9 > 0 * * * 0 9 1 - + 234 * 1 8 6 2 6 7 -",
        "x": 368.8,
        "y": 124.32,
        "width": 217.4417900000007,
        "height": 10.49,
        "pageIndex": 0
    },
    {
        "text": "6 / 2 8 1 3 2 1 7 7 0 1 2 9 2353 * < 9 5 0 0 < 1 6 5",
        "x": 368.8,
        "y": 138.38,
        "width": 217.54771000000014,
        "height": 10.49,
        "pageIndex": 0
    },
    {
        "text": "广东海鲜批发科技有限公司",
        "x": 110.15,
        "y": 94.10000000000002,
        "width": 107.87999999999998,
        "height": 8.99,
        "pageIndex": 0
    },
    {
        "text": "91340100698923643T",
        "x": 110.15,
        "y": 108.60000000000002,
        "width": 90.46637000000001,
        "height": 8.99,
        "pageIndex": 0
    },
    {
        "text": "附件为附有限公司",
        "x": 107.88,
        "y": 304.5,
        "width": 107.87999999999998,
        "height": 8.99,
        "pageIndex": 0
    },
    {
        "text": "91110108735575307R",
        "x": 107.88,
        "y": 318,
        "width": 91.46426000000001,
        "height": 8.99,
        "pageIndex": 0
    },
    {
        "text": "及服务和翻译外国法院",
        "x": 107.88,
        "y": 331.19,
        "width": 87.67,
        "height": 7.97,
        "pageIndex": 0
    },
    {
        "text": "6",
        "x": 195.5,
        "y": 331.19,
        "width": 3.985086076,
        "height": 7.97,
        "pageIndex": 0
    },
    {
        "text": "号院",
        "x": 199.48,
        "y": 331.19,
        "width": 15.94,
        "height": 7.97,
        "pageIndex": 0
    },
    {
        "text": "3",
        "x": 215.41,
        "y": 331.19,
        "width": 3.985086076,
        "height": 7.97,
        "pageIndex": 0
    },
    {
        "text": "号楼",
        "x": 219.39,
        "y": 331.19,
        "width": 15.94,
        "height": 7.97,
        "pageIndex": 0
    },
    {
        "text": "12",
        "x": 235.32,
        "y": 331.19,
        "width": 7.970172152,
        "height": 7.97,
        "pageIndex": 0
    },
    {
        "text": "层",
        "x": 243.29,
        "y": 331.19,
        "width": 7.97,
        "height": 7.97,
        "pageIndex": 0
    },
    {
        "text": "1501010-123303243",
        "x": 251.26,
        "y": 331.19,
        "width": 63.75980234399997,
        "height": 7.97,
        "pageIndex": 0
    },
    {
        "text": "天津银行海淀支行",
        "x": 107.88,
        "y": 344.64,
        "width": 89.89999999999999,
        "height": 8.99,
        "pageIndex": 0
    },
    {
        "text": "934010102230603",
        "x": 200.060025926,
        "y": 344.64,
        "width": 69.60077778,
        "height": 8.99,
        "pageIndex": 0
    },
    {
        "text": "011012122231",
        "x": 474.69,
        "y": 30.319999999999993,
        "width": 59.981280000000005,
        "height": 8.99,
        "pageIndex": 0
    },
    {
        "text": "41472234",
        "x": 474.69,
        "y": 44.81999999999999,
        "width": 39.987519999999996,
        "height": 8.99,
        "pageIndex": 0
    },
    {
        "text": "2021",
        "x": 474.69,
        "y": 58.81999999999999,
        "width": 17.980388368,
        "height": 8.99,
        "pageIndex": 0
    },
    {
        "text": "年",
        "x": 492.65999999999997,
        "y": 58.81999999999999,
        "width": 8.99,
        "height": 8.99,
        "pageIndex": 0
    },
    {
        "text": "12",
        "x": 501.65,
        "y": 58.81999999999999,
        "width": 8.990194184,
        "height": 8.99,
        "pageIndex": 0
    },
    {
        "text": "月",
        "x": 510.64,
        "y": 58.81999999999999,
        "width": 8.99,
        "height": 8.99,
        "pageIndex": 0
    },
    {
        "text": "09",
        "x": 519.63,
        "y": 58.81999999999999,
        "width": 8.990194184,
        "height": 8.99,
        "pageIndex": 0
    },
    {
        "text": "日",
        "x": 528.62,
        "y": 58.81999999999999,
        "width": 8.99,
        "height": 8.99,
        "pageIndex": 0
    },
    {
        "text": "14891 06345 28506 62702",
        "x": 474.69,
        "y": 73.24000000000001,
        "width": 107.46646000000008,
        "height": 8.99,
        "pageIndex": 0
    },
    {
        "text": "￥",
        "x": 500.46,
        "y": 284.03,
        "width": 8.99,
        "height": 8.99,
        "pageIndex": 0
    },
    {
        "text": "31.55",
        "x": 509.45,
        "y": 284.03,
        "width": 22.474985615999998,
        "height": 8.99,
        "pageIndex": 0
    }
]